[
    {
        "title": "PSO Application Development Intern",
        "company": "Interactive Intelligence",
        "location": "Indianapolis, IN",
        "start": "May 2016",
        "end": "Present",
        "contact": "Matt Smith",
        "contactEmail": "Matt.Smith@inin.com",
        "description": "As an intern in PSO Application Development at Interactive Intelligence, my tasks were initially different from most full-time employees. As the company was beginning a shift from an older platform to a newer platform named PureCloud, as an intern, my main tasks consisted of learning the PureCloud API, and attempting to use it in many ways to determine what its limitations were. This included making an iOS application and a web application to test its various chat technologies. Beyond working on just research and pushing our own API, I also helped lead development on an add-on web application that would extend the functionality of PureCloud's Analytics API."
    }, {
        "title": "Development Team Specialist",
        "company": "the Digital Corps",
        "location": "Ball State University, Muncie, IN",
        "start": "January 2015",
        "end": "May 2016",
        "contact": "Bryon O'Conner",
        "contactEmail": "bpoconner.bsu@gmail.com",
        "description": "As a Specialist at the Digital Corps, my duties included moderate to advanced application development as well as assisting others as needed or requested. Being a specialist, I frequently was called upon to take the lead in developing applications, and even lead development on one of the largest projects the Corps has experienced."
    }, {
        "title": "Development Team Apprentice",
        "company": "the Digital Corps",
        "location": "Ball State University, Muncie, IN",
        "start": "August 2015",
        "end": "January 2015",
        "contact": "Bryon O'Conner",
        "contactEmail": "bpoconner.bsu@gmail.com",
        "description": "As a second semester developer Apprentice, it was my job to begin applying my previously learned skills. Having passed my training, I was now expected to be a part of project teams. As a project team member, I wworked with other developers, designers, and even video editors to create professional grade products in a timely and organized manor."
    }, {
        "title": "Information Technology Intern",
        "company": "Midmark",
        "location": "Versailles, OH",
        "start": "May 2015",
        "end": "August 2015",
        "contact": "Nicole Robbins",
        "contactEmail": "nrobbins@midmark.com",
        "description": "For my second summer at Midmark, my duties were similar to those of the prior summer, but with a few additions. As a returning intern, on top of all the tasks I was assigned last year, I lead and trained the first year interns. I also was assigned as the Tier 2 technician to the Office Upgrade project. My role in the project was creating the Office package that would be deployed through SCCM 2012 and troubleshooting issues during champion testing. Because I had to leave for school before the project went live for the company, I also documented everything about the package/project in order to pass it along."
    }, {
        "title": "Development Team Apprentice",
        "company": "the Digital Corps",
        "location": "Ball State University, Muncie, IN",
        "start": "Jan 2015",
        "end": "May 2015",
        "contact": "Bryon O'Conner",
        "contactEmail": "bpoconner.bsu@gmail.com",
        "description": "As a Digital Corp Apprentice on the Development Team, it was my job to be trained on many skills, including UNIX terminal, iOS, Android, Front-End Web, and Back-End Web development. Because I finished my training early, I was also put on some low priority projects, including updating an iPad kiosk application."
    }, {
        "title": "Information Technology Intern",
        "company": "Midmark",
        "location": "Versailles, OH",
        "start": "May 2014",
        "end": "Aug 2014",
        "contact": "Nicole Robbins",
        "contactEmail": "nrobbins@midmark.com",
        "description": "As an IT Intern at Midmark, my duties were far and wide. A days work could range anywhere from new system setup to creating a batch script to automate a process. Overall, the duties consisted of computer imaging, hardware and software setup, changing networking cables to accompany moving/new teammates, creating deployable software packages, making batch programs to automate tasks, cleaning up and placing systems in an Active Directory, gathering system information for all company assets, and documenting new/improved procedures to make tasks simpler. Beyond this, I also participated in multiple projects, the first of which was organizing and setting up an inventory system for the IT Stock Room. Later on, I was placed at the head of deploying and initiating the remote backups of every corporate laptop, a task which I diligently worked on until my last day. In the end, working at Midmark was a very enjoyable experience that taught me a lot about how technology interacts in the corporate setting."
    }, {
        "title": "Computer Service Technician",
        "company": "Housing & Residence Life",
        "location": "Ball State University, Muncie, IN",
        "start": "Aug 2014",
        "end": "Jan 2015",
        "contact": "Brandon Dollar",
        "contactEmail": "bldollar@bsu.edu",
        "description": "As a Computer Service Technician for Housing and Residence Life, I was responsible for upkeep and repair for all computers, printers, and related items in residence halls, buildings, and for off campus students. Jobs would vary from simple software fixes to hardware repair/replacement."
    }, {
        "title": "Programming Lab Assitant",
        "company": "the Computer Science Department",
        "location": "Ball State University, Muncie, IN",
        "start": "Jan 2014",
        "end": "May 2014",
        "contact": "Dr. Jeff Zhang",
        "contactEmail": "01y0zhang@bsu.edu",
        "description": "As a computer Science teacher's aid, I was expected to help students in Python programming labs and outside of class, as well as aid in grading projects."
    }
]