{
	"title": "Simple Student DB",
	"status": "Completed, Unpublished",
	"link": "https://github.com/EPICmynamesBG/CS320.Assignment4",
	"linkText": "View on GitHub",
	"linkImage": "/assets/images/Social/github-1024-black.png",
	"start": "Nov 2, 2015",
	"end": "Nov 8, 2015",
	"event": "n/a",
	"description": [
                "Simple Student DB is an application made for my mobile applications development course. The requirements were relatively simple: create an application that can interact with an on campus database of students. Essentially, the app had to be able to view, edit, create, and delete a student. However, I used this application as a way to further my knowledge and push myself. From this, I created not just a simple app, but an elegant, well-themed app with an added watch application and the ability to do background fetching and generate updates.",
				"Before this application, I had no experience developing an Apple Watch application besides a demo I recieved from Apple at a the BoilerMake 2015 hackathon. I was determined though to make a watch app, and I did. The watch app uses the same networking calls as the full iOS app, but the interface is more limiting. On the watch, it is only possible to view the students, their data, and delete one.",
				"Development was not as simple as I had hoped. I made many changes and modifications to some of the backend code of my iOS to help make my watch app code look and implement better. I learned how to use pre-processing marks in my networking file to safely differentiate the runtime code between iOS and the watch app since some of the WK networking isn't the same as iOS. Another thing I struggled with in developing this app was background fetching. This is the first time I've actually used the AppDelegate in an app, and it was enlightening. Generating notifications from this background fetch and comparison was also a challenge as I had also never done that.",
				"In the end, the background fetching worked well in testing, but not as well on live device functinoality. Nonetheless, I consider the knowledge learned from the app a success. On the other hand, the watch app works quite well, and although it is simple, I am proud of it for the fact that it simply works."
            ],
	"images": [
				"/SimpleStudentDB/SimpleStudentDB_watch1.png",
				"/SimpleStudentDB/SimpleStudentDB_watch2.png",
				"/SimpleStudentDB/SimpleStudentDB_watch3.png",
				"/SimpleStudentDB/SimpleStudentDB_watch4.png",
				"/SimpleStudentDB/SimpleStudentDB1.png",
				"/SimpleStudentDB/SimpleStudentDB2.png",
				"/SimpleStudentDB/SimpleStudentDB3.png",
				"/SimpleStudentDB/SimpleStudentDB4.png",
				"/SimpleStudentDB/SimpleStudentDB5.png"
				
            ]
}