{
    "title": "Subito Bot",
    "status": "Hosted, Published on GitHub",
    "linkText": "View on GitHub",
    "linkImage": "/assets/images/Social/Github_icon.svg",
    "link": "https://github.com/EPICmynamesBG/subito-bot",
    "start": "August 2017",
    "end": "Ongoing",
    "event": "n/a",
    "description": [
      "Subito bot is a side project that spawned from an idea with coworkers. In my first few weeks at Zylo, I was introduced to a local soup place, Subito, in downtown Indianapolis. After a while, joking turned into a reality, and I began to work on the bot on the side."
      "From the tech stack level, it's a Node JS server running on top of a MySQL database. Swagger is being used to document endpoints, and the project features a RESTful design, with the exception of the single endpoint used to handle Slack slash command. This specific endpoint really functions as a complex parser and switch statement, which redirects to the appropriate controller method (endpoint) as needed.",
      "The Subito bot server application is a combination of a few simple components, including the API (for Slash command reception/interaction) and a data parser, which has evolved as the Subito website has changed. In the initial versions of the application, the parser was an HTML parser that scraped the Subito soup menu and ingested it into a table. Over time, Subito updated their site to have the menu available as a PDF file; thus, the parser was updated to be able to read and ingest the data from a PDF rather than scraping HTML. It's not always perfect, but that's where some intelligent alerting comes into play. Whenever the wrong number of soups per day are detected, the bot sends me a Slack notification of all of the days that are potentially incorrect. At this point, it's a manual process for me to go in and fix the data, but most of the heavy lifting is done.",
      'As any software goes, features are requested. Once the initial component of "What are today\'s soups?" was done, work continued to develop searching, then a week view, and finally a subscription component. Using a simple command of "/subito subscribe", Slack members could get signed up to recieve a notification with the days soups. And, as every feature goes, customization was requested, so a later command was implemented where then subscribed members could update the time of day that they recieve the notification.',
      "To date, Subito is one of my longest maintained projects. It's been fun to work on, and has given me a playground of sorts to experiment with other ways of doing things, including testing and linter configurations. It's exciting to hear my coworkers mention it, and I'm happy to continue maintaining it so long as someone is finding value and enjoyment from it."
    ],
    "images": [
        "/Subito-Bot/screenshot_1.png",
        "/Subito-Bot/screenshot_2.png",
        "/Subito-Bot/hello.png",
        "/Subito-Bot/search.png",
        "/Subito-Bot/subscribe_1.png",
        "/Subito-Bot/subscribe_2.png",
        "/Subito-Bot/subscribe_3.png",
        "/Subito-Bot/unsubscribe.png",
        "/Subito-Bot/week_view.png",
        "/Subito-Bot/settings_time.png"
    ]
}
